Функция СведенияОВнешнейОбработке() Экспорт
  ПараметрыРегистрации = Новый Структура;
  ПараметрыРегистрации.Вставить("Вид", "ДополнительнаяОбработка");
  ПараметрыРегистрации.Вставить("Наименование", "Загрузка данных КМД и смет стройки"); //Наименование обработки, которым будет заполнено наименование элемента справочника
  ПараметрыРегистрации.Вставить("Версия", "1.0");
  ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
  ПараметрыРегистрации.Вставить("Информация", "Загрузка данных КМД и смет стройки"); //Краткая информация по обработке, описание обработки
  ПараметрыРегистрации.Вставить("ВерсияБСП", "2.3.6.152");
  ТаблицаКоманд = ПолучитьТаблицуКоманд();
  ДобавитьКоманду(ТаблицаКоманд,
          "Загрузка данных КМД и смет стройки", //представление команды в пользовательском интерфейсе
          "Загрузка данных КМД и смет стройки", //идентификатор команды; любая строка, уникальная в пределах данной обработки
          "ОткрытиеФормы", Истина, "");
  ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
  Возврат ПараметрыРегистрации;
КонецФункции

Функция ПолучитьТаблицуКоманд()
	
  Команды = Новый ТаблицаЗначений;
  Команды.Колонки.Добавить( "Представление", Новый ОписаниеТипов("Строка") );
  Команды.Колонки.Добавить( "Идентификатор", Новый ОписаниеТипов("Строка") );
  Команды.Колонки.Добавить( "Использование", Новый ОписаниеТипов("Строка") );
  Команды.Колонки.Добавить( "ПоказыватьОповещение", Новый ОписаниеТипов("Булево") );
  Команды.Колонки.Добавить( "Модификатор", Новый ОписаниеТипов("Строка") );
  
  Возврат Команды;
  
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
  НоваяКоманда = ТаблицаКоманд.Добавить();
  НоваяКоманда.Представление = Представление;
  НоваяКоманда.Идентификатор = Идентификатор;
  НоваяКоманда.Использование = Использование;
  НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
  НоваяКоманда.Модификатор = Модификатор;
КонецПроцедуры