

&НаКлиенте
Процедура НазваниеФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	
	
		
	#Если ВебКлиент Тогда
		Если Не ПодключитьРасширениеРаботыСФайлами() Тогда
			//УстановитьРасширениеРаботыСФайлами();
			НачатьУстановкуРасширенияРаботыСФайлами(Неопределено);
			ПодключитьРасширениеРаботыСФайлами();
		КонецЕсли;
	#КонецЕсли
	
	//ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	//ДиалогВыбораФайла.Фильтр                      = НСтр("ru='XML файл (*.xlsx)|*.xlsx'");
	//ДиалогВыбораФайла.Заголовок                   = НСтр("ru='Выберите XLSX файл'");
	//ДиалогВыбораФайла.ПредварительныйПросмотр     = Ложь;
	//ДиалогВыбораФайла.Расширение                  = "xml";
	//ДиалогВыбораФайла.ИндексФильтра               = 0;
	//ДиалогВыбораФайла.ПолноеИмяФайла              = Элемент.ТекстРедактирования;
	//ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Ложь;
	
	//Если ДиалогВыбораФайла.Выбрать() Тогда
	//	Объект.НазваниеФайла = ДиалогВыбораФайла.ПолноеИмяФайла;
	//КонецЕсли;
	
	//*-
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьВыборФайлаRk", ЭтаФорма);
    ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
    ДиалогОткрытияФайла.Заголовок = "Выбор файла";
    ДиалогОткрытияФайла.Фильтр = "xls*-файлы(*.xls*)|*.xls*|";
    ДиалогОткрытияФайла.ИндексФильтра = 0;
    ДиалогОткрытияФайла.ПредварительныйПросмотр = Ложь;
    ДиалогОткрытияФайла.ПроверятьСуществованиеФайла = Истина;
    ДиалогОткрытияФайла.МножественныйВыбор = Ложь; 

    НачатьПомещениеФайлов(ОписаниеОповещения, , ДиалогОткрытияФайла, Истина, УникальныйИдентификатор);
	
	
	
	//*-
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ПриЗакрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	
	УдалитьФайлы(Объект.ПутьКФайлуНаСервере);

КонецПроцедуры





&НаКлиенте
Процедура ОбработатьВыборФайлаRk(ПомещенныеФайлы, ДополнительныеПараметры) Экспорт

    Если ПомещенныеФайлы = Неопределено Тогда
        Возврат;
    КонецЕсли;

	Для каждого ПереданныйФайл Из ПомещенныеФайлы Цикл
		
        ПутьКФайлу = ПереданныйФайл.Имя;
        Адрес = ПереданныйФайл.Хранение;
		Объект.НазваниеФайла = ПереданныйФайл.ПолноеИмя;
		
    КонецЦикла;
    
    RkНаСервере(Адрес);

КонецПроцедуры



&НаСервере
Процедура RkНаСервере(Адрес)
    
    ФайлДляЗагрузки = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Адрес));
    Объект.ПутьКФайлуНаСервере = ПолучитьИмяВременногоФайла("xlsx");
    ФайлДляЗагрузки = ФайлДляЗагрузки.Получить();
    ФайлДляЗагрузки.Записать(Объект.ПутьКФайлуНаСервере);
         
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)

	
	//Отказ = ЗагрузитьМатериалыВСтроительнуюРаботуНаСервере();
	
	ТабличныйДокумент = ЗагрузитьМатериалыВСтроительнуюРаботуНаСервере();
	
	ТабличныйДокумент.Показать();
	
	//Если НЕ Отказ Тогда
		УдалитьФайлы(Объект.ПутьКФайлуНаСервере);
	//КонецЕсли;

КонецПроцедуры


&НаСервере
Функция ЗагрузитьМатериалыВСтроительнуюРаботуНаСервере();
	
	ТабДок = Новый ТабличныйДокумент;
	Попытка
		ТабДок.Прочитать(Объект.ПутьКФайлуНаСервере, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();
		Возврат Истина;
	КонецПопытки;
	
	НомерСтроки = 1;
	КолСтр = ТабДок.ВысотаТаблицы;
	
	Для Сч = НомерСтроки по КолСтр Цикл
		
			
	КонецЦикла;
	
	Возврат ТабДок;
КонецФункции



&НаКлиенте
Процедура НазваниеФайлаОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

